{- 
Задание 1: 
Составить список сумм соответствующих элементов трех заданных списков. Длина результирующего списка должна быть равна длине самого длинного из заданных списков, при этом "закончившиеся" списки не должны давать вклада в суммы.

sum3 :: Num a => [a] -> [a] -> [a] -> [a]
sum3 = undefined
GHCi> sum3 [1,2,3] [4,5] [6]
[11,7,3]
-}
sum3 :: Num a => [a] -> [a] -> [a] -> [a]
sum3 (x:xx) (y:yy) (z:zz) = (x+y+z) : sum3 xx yy zz
sum3 [] [] [] = []
sum3 [] (y : yy) (z : zz) = y + z : sum3 [] yy zz
sum3 (x : xx) [] (z:zz) = x + z : sum3 xx [] zz
sum3 (x : xx) (y:yy) [] = x + y : sum3 xx yy []
sum3 (x:xx) [] [] = x : sum3 xx [] []
sum3 [] (y:yy) [] = y : sum3 [] yy []
sum3 [] [] (z:zz) = z : sum3 [] [] zz
